app/views/posts/index.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
<div class="large-12 medium-12 small-12 columns">
 <%= image_tag(@highestvoted.first.post_url) if @highestvoted.first.post? %>