app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("text", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "test"], ["post_id", 1], ["created_at", "2015-07-22 16:31:14.982051"], ["updated_at", "2015-07-22 16:31:14.982051"]]
---
 def create

    @post = Post.find(params[:post_id])
    @test=params[:comment][:text]

    @comment = @post.comments.create(comment_params)