app/controllers/posts_controller.rb

  def index
    @highestvoted=Post.highest_voted.limit(1)

    @posts = Post.where.not(:id=>@highestvoted.first.id)
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" DESC LIMIT 1
SELECT  "posts".* FROM "posts"  ORDER BY cached_votes_score DESC LIMIT 30

  def upvote


  @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

def downvote
  @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @post = Post.new(post_params)

    @post.post=params[:post][:post]
    # File.open('/images') do |f|
    # @post.post = f
    # end
    @post.text=params[:text].first
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "post", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["post", nil], ["text", "<p>cvzvzx</p>"], ["created_at", "2015-08-01 15:14:52.132115"], ["updated_at", "2015-08-01 15:14:52.132115"]]

  def update
    respond_to do |format|
       @post.post=params[:post][:post]
      #binding.pry
    @post.text=params[:text].first
      if @post.update(post_params)
---
UPDATE "posts" SET "post" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post", "8243-dark-road-through-woods-1920x1080-nature-wallpaper.jpg"], ["text", "<p>&nbsp;hey</p>"], ["updated_at", "2015-07-27 18:59:53.579242"], ["id", 6]]